<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>마포 역사</title>

<style>
.txt {text-align:center;}
</style>

</head>
<body>
<div class="txt">
<p>서울의 중서부 한강연안에 위치한 마포지역은 안산에서 갈라진 와우산 구릉산맥과 노고산 구릉산맥, 용산 구릉 산맥이 강으로 뻗어 세 산맥연안에 호수처럼 발달한 서호, 마포, 용호가 있었는데, 이 3호를 삼포(三浦-3개의 포구)라고 불렀고 이 삼개 중 지금의 마포를 마포강, 마포항 등으로 불려 마포라는 명칭이 여기서 유래되었다.

마포구는 이처럼 옛날부터 수상교통의 요충지로서, 또는 삼남지방에서 오는 곡물을 저장하는 창고가 있는 지역으로서 일찍부터 발달된 어촌이 형성되었다.

마포구 일대는 조선 전기에는 한성부 관할구역으로서 성밖 10리내에 있기는 하였으나 독립된 행정구역으로 설정되지 못하였던것으로 짐작되며, 조선후기 두모방, 한강방, 둔지방, 용산방, 서강방 등 5개의 방이 한성부 행정구역으로 새로 설정되면서 마포구일부가 용산방과 서강방에 속하게 되었다.

1910년 10월 조선총독부는 1495년부터 존속되어 오던 한성부를 경성부로 개칭하여 경기도에 예속시켰고, 이듬해 4월에는 경기도령 제3호에 의해 경성부에 부, 면제도를 실시하였으며, 이때 종전의 용산방과 서강방은 용산면, 서강면으로 개칭되었고 각각 31개 동리와 10개 동리를 관할하게 되었다.

1911년의 지방관제는 3년만에 개편되어 1913년 12월 총독부령 제111호에 의해 마포는 용산면 일부가 경성부 서부로 편입되고, 서강면은 경기도 고양군에 편입되었다. 그후 마포구는 여러 차례 행정구역 변천을 겪다가 1944년 10월 23일 총독부령 제 350호에 의해 서대문구와 용산구의 일부를 분할하여 지금의 마포구가 신설되었으며, 설치당시의 관할구역을 보면 아현정, 공덕정, 신공덕정, 도화정, 마포정, 토정정, 용강정, 염리정, 대흥정, 신수정, 구수정, 현석정, 신정정, 하중정, 창전정, 동교정, 서교정, 상수일정, 하수일정, 당인정, 합정정, 망원정, 율도정등 23개 정이었다. 1945년 8월 15일 해방되어 일제가 물러나고 미군이 입성하여 미군정이 실시되었고, 1945년 10월 16일에 각구의 행정을 담당하는 "구역소"를 "구청"으로 "구장"을 "구청장"으로 개칭하였으며, 이때부터 마포구역소는마포구청으로, 행정구역 명칭인 "정"은 "동"으로 불리워지게 되었다.

1955년 4월 18일에는 시조례 제66호에 의하여 종전의 동회를 동으로 하였으며, 각 구청에는 행정동을 따로 정하여 행정업무를 담당하였는데, 이때 마포구는 아현1,2,3,4,5동, 신공덕1,2동, 도화1,2동, 관란동, 대흥동, 염리동, 신석동, 세교동 등의 19개 행정동을 두었다.

그후 여러 차례의 동명 및 관할 구역 변경을 거처 1985년 9월 1일 시조례 제 2016호로 용강동 일부를 염리동에 편입하고, 1989년 6월 1일을 기해 서울특별시마포구동명칭및 구역획정조례 제84호로 하수동 전역을 상수동으로, 망원동 28번지를 서교동으로, 망원동중 망원1,2동 관할구역을 제외한 전지역을 합정동으로 편입하는 등 동계조정을 하여 지금에 이르게 되었다.</p>
</div>

</body>
</html>